# #小明有20块钱，红双喜10块钱，玉溪25块钱，大前门5块钱   求出小明可以买那种烟a=20
# a=20
# if(a>=5):
#     print(a,"能买大前门")
# if(a>=10):
#     print(a,"能买红双喜")
# if(a>=15):
#     print(a,"能买红双喜和大前门")
# if(a>=25):
#     print("可以买玉溪")
# #成人票 200 12岁以下的小孩票100 60岁以上的老人票 150 小明今年18岁，去买票应该买那种票？
# b=18
# if (b >= 18):
#     print(b, "成人票200")
# elif(b<=12):
#     print(b,"未成年票100")
# elif(b>=60):
#     print(b,"老人票150")
#
# for i in range(2,50):
#     if i % 2 == 0:
#       print(i)

#  for f in range(1,10):
#     for g in range(1,f+1):
#       print(g,'x',f,'=', f*g, ".\t",end = '')
#     print()
# for i in range (1,100):
#     for g in range (0,9):
#        print("你好")
#     print()
#成绩0-59不及格，60-70及格，70-80良好，80上优秀[1,60,30,90.100,20,70.59.69.71,80,84]
# for a in [1,60,30,90,100,20,70,59,69,71,80,84]:
#     if(60<=a<70):
#         print(a,'及格')
#     elif(70<=a<80):
#         print(a,'良好')
#     elif(a>=80):
#         print(a,'优秀')
#     else:
#         print(a,'不及格')
# r=222#成绩0-59不及格，60-70及格 70-80 良好 80以上是优秀    [90,100,81,84]判断下改组成绩是否全部都是优秀
# for b in [90,100,84,90,70]:
#    if(b)<80:
#      r = 111
# if(r==222):
#     print('优秀')
# else:
#     print('不优秀')
#100
#"01010010001110001001001010101010010101" 计算下几个0 几个1
# a=0
# b=0
# for i in "01010010001110001001001010101010010101":
#      if(i=='0'):
#         a=a+1
#      else:
#          b=b+1
# print(a,'个 0' ,  b,'个 1')

#100以内的质数
# a=
# for d in range[2,100]:
#求1+2+3+4...+100
# a=0
# for i in range(1,101):
#     a=a+i
# print(a)
#求出10的阶乘
# a = 1
# for i in range(1,11):
#
#     a=a*i
# print(a)




